EX04: PROC OPTIONS (MAIN);                                                      DCL A DECIMAL FIXED INIT(2);                                                    DCL B DECIMAL FIXED;                                                            DCL P POINTER;                                                                  DCL D DECIMAL FIXED BASED(P);                                                   P = ADDR(A);                                                                    B = D;                                                                          END EX04;                                                                       